import 'dart:math';

import 'package:flutter/material.dart';

class Question extends StatefulWidget {
  @override
  State<StatefulWidget> createState() {
    return _Question();
  }
}

/*
    "1. ด้านเป้าทะยานใจ *", //0
    "", //1
    "1. ข้าพเจ้ามีการวางแผนหรือคิดมาก่อนหรือไม่ว่าตนเองต้องการมีชีวิตแบบไหน", //2
    "2. ข้าพเจ้าคิดถึงอนาคตเสมอว่าโตขึ้นจะเรียน หรือทำงานอะไร", //3
    "3. ข้าพเจ้าคิดว่าการมีความฝันหรือมีเป้าหมายในชีวิตมีความสำคัญกับชีวิต", //4
    "4. ข้าพเจ้าเคยวาดฝันหรือภาพในอนาคต", //5
    "5. ข้าพเจ้าเคยเห็นคนที่ประสบความสำเร็จในชีวิต และเคยคิดจะประสบความสำเร็จเช่นนั้น", //6
    "7. ข้าพเจ้าคิดอยู่เสมอว่าตนเองและครอบครัวคือปัจจัยสำคัญในการที่จะช่วยให้ฝันเป็นจริง", //7
    "8. ข้าพเจ้าคิดอยู่เสมอว่าอาจารย์ หรือ เพื่อน คือปัจจัยสำคัญในการที่จะช่วยให้ฝันเป็นจริง", //8
    "8. สิ่งที่ข้าพเจ้าจะทำเป็นสิ่งที่ทำให้ข้าพเจ้าได้รับความชื่นชม/ความสนใจ", //9
    "9. ข้าพเจ้าคิดว่า พ่อ/แม่/ครอบครัว คือปัจจัยสำคัญในการที่จะช่วยให้ความฝันของคุณเป็นจริง", //10
    "10. ข้าพเจ้าคิดว่าตัวเองคือปัจจัยสำคัญในการที่จะช่วยให้ความฝันของคุณเป็นจริง", //11
    //question 2
    "2. ด้านแรงบันดาลใจ *", //12
    "", //13
    "1. ข้าพเจ้าเสริมสร้างกำลังใจแก่ตนเองเมื่อต้องเผชิญปัญหาและอุปสรรค", //14
    "2. ข้าพเจ้ามีความรู้สึกที่ดีและคิดในแง่บวกให้แก่ตนเอง", //15
    "3. ข้าพเจ้าสร้างกำลังใจในการทำงานเมื่อต้องเผชิญปัญหาและอุปสรรค", //16
    "4. ข้าพเจ้าแสดงความเชื่อมั่นกับเพื่อนว่าสามารถทำงานบรรลุเป้าหมายได้", //17
    "5. ข้าพเจ้าชอบงานที่ท้าทายความสามารถ", //18
    "6. ข้าพเจ้ามีความเชื่อมั่นในความสามารถของตนเอง", //19
    "7. เมื่อข้าพเจ้าได้รับมอบหมายงาน ท่านมีความรู้สึกมุ่งมั่นพยายามที่จะทำมันให้สำเร็จทุกครั้ง", //20
    "8. ข้าพเจ้าชอบใช้สิ่งล่อใจในการทำงาน", //21
    "9. สิ่งที่ข้าพเจ้าอยากทำในอนาคตมีแรงบันดาลใจมาจากคนใกล้ชิด เช่น พ่อแม่ ครู หรือบุคคลในครอบครัว", //22
    "10. แรงบันดาลใจในอนาคตของข้าพเจ้ามาจากท่านชื่นชมคนเก่ง มีความสามารถ สร้างรายได้จากการทำธุรกิจ", //23
    //question 3
    "3. ด้านแรงจูงใจ *", //24
    "", //25
    "1. ข้าพเจ้าคิดว่าสิ่งที่ให้คิดและทำนั้นมีความน่าสนใจและท้าทายความสามารถ", //26
    "2. บุคคลรอบข้าง เช่น พ่อแม่ เป็นคนแนะนำ/บอกให้ข้าพเจ้าทำสิ่งนั้น", //27
    "3. ข้าพเจ้าคิดว่าหากทำสิ่งนั้นแล้วบุคคลรอบข้างจะภาคภูมิใจในตัวข้าพเจ้า", //28
    "4. ข้าพเจ้าคิดว่าสิ่งนั้นเป็นหนึ่งในเป้าหมายชีวิตของข้าพเจ้า", //29
    "5. ข้าพเจ้าคิดว่า ข้าพเจ้าจะสนุกกับการทำสิ่งนั้น", //30
    "6. ข้าพเจ้าคิดว่าหากทำสิ่งนั้นแล้วบุคคลรอบข้างจะยอมรับในตัวข้าพเจ้า", //31
    "7. ข้าพเจ้ารู้สึกว่าสิ่งนั้นเป็นสิ่งที่ดีมีคุณค่าต่อตัวข้าพเจ้า", //32
    "8. ข้าพเจ้าคิดว่าสิ่งนั้นท้าทายกับความสามารถของข้าพเจ้า", //33
    "9. ข้าพเจ้าต้องการ การยอมรับและการเคารพจากบุคคลรอบข้าง", //34
    "10. ข้าพเจ้าถูกบังคับให้ทำสิ่งต่าง ๆ อยู่เสอมตามคำบอกจากคนอื่น", //35
    //question 4
    "4. ด้านมูลเหตุแห่งใจ *", //36
    "", //37
    "1. ข้าพเจ้ามีความต้องการให้อนาคตมีความเป็นอยู่ที่ดี", //38
    "2. ข้าพเจ้าจะเลือกทำสิ่งใดจะนึกถึงความสุขของตัวเองเป็นหลัก", //39
    "3. ข้าพเจ้าต้องการมีอนาคตมั่นคง", //40
    "4. ข้าพเจ้าต้องการประสบความสำเร็จในชีวิต", //41
    "5. ข้าพเจ้าจะเลือกทำสิ่งใดสิงนั้นต้องเป็นสิ่งที่ตัวเองรัก และมีคุณค่าเสมอ", //42
    "6. ถ้าข้าพเจ้าทำบางสิ่งที่ผิดพลาดไป ข้าพเจ้าจะนำความผิดพลาดนั้นมาเป็นบทเรียนในชีวิตเสมอ", //43
    "7. ข้าพเจ้าจะเลือกสิ่งที่ซื่อสัตย์ ยุติธรรม และมีความเท่าเทียมกันเสมอ", //44
    "9. ข้าพเจ้าต้องการให้อนาคตชีวิตมีความสมดุลในชีวิต", //45
    "10.ข้าพเจ้าดูแล สุขภาพร่างกายออย่างสม่ำเสมอ", //46
    //question 5
    "5. ด้านสิ่งประสงค์ล่อใจ *", //47
    "", //48
    "1. สิ่งที่ข้าพเจ้าอยากทำต้องมีความน่าสนใจ", //49
    "2. สิ่งที่ข้าพเจ้าจะทำต้องเป็นสิ่งที่มีอิทธิพลต่อครอบครัว", //50
    "3. สิ่งที่ข้าพเจ้าจะทำต้องเป็นสิ่งที่มีอิทธิพลด้านอารมณ์/ความรู้สึกกับคนหมู่มาก", //51
    "4. สิ่งที่ข้าพเจ้าจะทำต้องเป็นสิ่งที่มีอิทธิพลกับคนหมู่มาก", //52
    "5. สิ่งที่ข้าพเจ้าจะทำสิ่งนั้นสามารถทำให้มีอนาคตที่มั่นคง", //53
    "6. สิ่งที่ข้าพเจ้าจะทำสิ่งนั้นมีระดับผลตอบแทนในรูปแบบของเงินที่น่าสนใจ", //54
    "7. สิ่งที่ข้าพเจ้าจะทำสิ่งนั้นทำให้ข้าพเจ้าเป็นคนมีชื่อเสียง", //55
    "8. สิ่งที่ข้าพเจ้าจะทำเป็นสิ่งที่ทำให้ข้าพเจ้าได้รับความชื่นชม/ความสนใจ", //56
    "9. สิ่งนั้นทำให้ข้าพเจ้าใช้ความสามารถตนเองอย่างเต็มที่ เป็นอิสระ ไม่ขึ้นตรงกับใคร", //57
    "10. สิ่งที่นั้นต้องเป็นสิ่งที่คนทั่วไปอยากเอาเป็นแบบอย่าง", //58
    //question 6
    "6. ด้านผู้ปกครอง *", //59
    "", //60
    "1. พ่อแม่เป็นต้นแบบของการมีเป้าหมายที่ชัดเจน ในทุกเรื่องที่ท่านทำ", //61
    "2. พ่อแม่คอยบอกใหฉันคิดถึงเป้าหมายในการเรียนอยู่เสมอ", //62
    "3. พ่อแม่คอยติดตามดูแลพัฒนาการด้านการเรียนของฉันเสมอ", //63
    "4. พ่อแม่สงเสริมใหฉันค้นพบเป้าหมายในการประกอบอาชีพ", //64
    "5. พ่อแม่ส่งเสริมให้ฉันค้นพบ จุดดี จุดเปลี่ยน ของตัวฉันอยู่เสมอ", //65
    "6. พ่อแม่ช่วยหาข้อมูลเกี่ยวกับอาชีพในอนาคต", //66
    "7. โดยสวนใหญ่พ่อแม่สนับสนุนให้ฉันเรียนรู้และพัฒนาเป้าหมายของตัวเอง", //67
    "8. พ่อแม่มีการสร้างวินัยและฝึกระเบียบให้กับฉันอยู่เสมอ", //68
    "9. พ่อแม่เป็นคนที่สุภาพ รู้จักแบ่งปัน มีน้ำใจต่อผู้อื่น มีความกตัญญู ซื่อสัตย์สุจริต", //69
    "10. พ่อแม่รับฟัง เคารพความคิดเห็นซึ่งกันและกัน", //70
    //question 7
    "7. ด้านความเป็นตัวตน *", //71
    "", //72
    "1. ข้าพเจ้าชอบเคลื่อนไหวและทำกิจกรรมมาก", //73
    "2. ข้าพเจ้าชอบอยู่ร่วมกับผู้อื่น", //74
    "3. ข้าพเจ้าชอบทำบางอย่างมากกว่าอยู่นิ่งเฉย", //75
    "4. ข้าพเจ้าสามารถทำให้ผู้อื่นเชื่อมั่นในความคิดของข้าพเจ้า", //76
    "5. เมื่อข้าพเจ้าพูด ผู้อื่นจะรับฟังและทำตามที่ข้าพเจ้าพูด", //77
    "6. ข้าพเจ้าประพฤติปฏิบัติอย่างถูกตองและซื่อสัตยกับผู้อื่น", //78
    "7. ถ้าผู้อื่นไม่ให้ความยุติธรรมแก่ข้าพเจ้า ข้าพเจ้าจะให้อภัยแก่เขา", //79
    "8. ถ้าเพื่อนร่วมชั้นมีความลำบาก ข้าพเจ้าจะชอบช่วยเหลือพวกเขาเสมอ", //80
    "9. ข้าพเจ้าเคารพในกฎระเบียบและคำสั่ง", //81
    "10. เมื่อข้าพเจ้าเริ่มทำบางสิ่งบางอย่าง ข้าพเจ้าต้องทำใหมันสำเร็จเรียบร้อยทุกประการ" //82
 */
class _Question extends State<Question> {
  List<String> _q = [
    "1. ด้านเป้าทะยานใจ *",
    "",
    "1. ข้าพเจ้ามีการวางแผนหรือคิดมาก่อนหรือไม่ว่าตนเองต้องการมีชีวิตแบบไหน",
    "2. ข้าพเจ้าคิดถึงอนาคตเสมอว่าโตขึ้นจะเรียน หรือทำงานอะไร",
    "3. ข้าพเจ้าคิดว่าการมีความฝันหรือมีเป้าหมายในชีวิตมีความสำคัญกับชีวิต",
    "4. ข้าพเจ้าเคยวาดฝันหรือภาพในอนาคต",
    "5. ข้าพเจ้าเคยเห็นคนที่ประสบความสำเร็จในชีวิต และเคยคิดจะประสบความสำเร็จเช่นนั้น",
    "7. ข้าพเจ้าคิดอยู่เสมอว่าตนเองและครอบครัวคือปัจจัยสำคัญในการที่จะช่วยให้ฝันเป็นจริง",
    "8. ข้าพเจ้าคิดอยู่เสมอว่าอาจารย์ หรือ เพื่อน คือปัจจัยสำคัญในการที่จะช่วยให้ฝันเป็นจริง",
    "8. สิ่งที่ข้าพเจ้าจะทำเป็นสิ่งที่ทำให้ข้าพเจ้าได้รับความชื่นชม/ความสนใจ",
    "9. ข้าพเจ้าคิดว่า พ่อ/แม่/ครอบครัว คือปัจจัยสำคัญในการที่จะช่วยให้ความฝันของคุณเป็นจริง",
    "10. ข้าพเจ้าคิดว่าตัวเองคือปัจจัยสำคัญในการที่จะช่วยให้ความฝันของคุณเป็นจริง",
    //question 2
    "2. ด้านแรงบันดาลใจ *",
    "",
    "1. ข้าพเจ้าเสริมสร้างกำลังใจแก่ตนเองเมื่อต้องเผชิญปัญหาและอุปสรรค",
    "2. ข้าพเจ้ามีความรู้สึกที่ดีและคิดในแง่บวกให้แก่ตนเอง",
    "3. ข้าพเจ้าสร้างกำลังใจในการทำงานเมื่อต้องเผชิญปัญหาและอุปสรรค",
    "4. ข้าพเจ้าแสดงความเชื่อมั่นกับเพื่อนว่าสามารถทำงานบรรลุเป้าหมายได้",
    "5. ข้าพเจ้าชอบงานที่ท้าทายความสามารถ",
    "6. ข้าพเจ้ามีความเชื่อมั่นในความสามารถของตนเอง",
    "7. เมื่อข้าพเจ้าได้รับมอบหมายงาน ท่านมีความรู้สึกมุ่งมั่นพยายามที่จะทำมันให้สำเร็จทุกครั้ง",
    "8. ข้าพเจ้าชอบใช้สิ่งล่อใจในการทำงาน",
    "9. สิ่งที่ข้าพเจ้าอยากทำในอนาคตมีแรงบันดาลใจมาจากคนใกล้ชิด เช่น พ่อแม่ ครู หรือบุคคลในครอบครัว",
    "10. แรงบันดาลใจในอนาคตของข้าพเจ้ามาจากท่านชื่นชมคนเก่ง มีความสามารถ สร้างรายได้จากการทำธุรกิจ",
    //question 3
    "3. ด้านแรงจูงใจ *",
    "",
    "1. ข้าพเจ้าคิดว่าสิ่งที่ให้คิดและทำนั้นมีความน่าสนใจและท้าทายความสามารถ",
    "2. บุคคลรอบข้าง เช่น พ่อแม่ เป็นคนแนะนำ/บอกให้ข้าพเจ้าทำสิ่งนั้น",
    "3. ข้าพเจ้าคิดว่าหากทำสิ่งนั้นแล้วบุคคลรอบข้างจะภาคภูมิใจในตัวข้าพเจ้า",
    "4. ข้าพเจ้าคิดว่าสิ่งนั้นเป็นหนึ่งในเป้าหมายชีวิตของข้าพเจ้า",
    "5. ข้าพเจ้าคิดว่า ข้าพเจ้าจะสนุกกับการทำสิ่งนั้น",
    "6. ข้าพเจ้าคิดว่าหากทำสิ่งนั้นแล้วบุคคลรอบข้างจะยอมรับในตัวข้าพเจ้า",
    "7. ข้าพเจ้ารู้สึกว่าสิ่งนั้นเป็นสิ่งที่ดีมีคุณค่าต่อตัวข้าพเจ้า",
    "8. ข้าพเจ้าคิดว่าสิ่งนั้นท้าทายกับความสามารถของข้าพเจ้า",
    "9. ข้าพเจ้าต้องการ การยอมรับและการเคารพจากบุคคลรอบข้าง",
    "10. ข้าพเจ้าถูกบังคับให้ทำสิ่งต่าง ๆ อยู่เสอมตามคำบอกจากคนอื่น",
    //question 4
    "4. ด้านมูลเหตุแห่งใจ *",
    "",
    "1. ข้าพเจ้ามีความต้องการให้อนาคตมีความเป็นอยู่ที่ดี",
    "2. ข้าพเจ้าจะเลือกทำสิ่งใดจะนึกถึงความสุขของตัวเองเป็นหลัก",
    "3. ข้าพเจ้าต้องการมีอนาคตมั่นคง",
    "4. ข้าพเจ้าต้องการประสบความสำเร็จในชีวิต",
    "5. ข้าพเจ้าจะเลือกทำสิ่งใดสิงนั้นต้องเป็นสิ่งที่ตัวเองรัก และมีคุณค่าเสมอ",
    "6. ถ้าข้าพเจ้าทำบางสิ่งที่ผิดพลาดไป ข้าพเจ้าจะนำความผิดพลาดนั้นมาเป็นบทเรียนในชีวิตเสมอ",
    "7. ข้าพเจ้าจะเลือกสิ่งที่ซื่อสัตย์ ยุติธรรม และมีความเท่าเทียมกันเสมอ",
    "9. ข้าพเจ้าต้องการให้อนาคตชีวิตมีความสมดุลในชีวิต",
    "10.ข้าพเจ้าดูแล สุขภาพร่างกายออย่างสม่ำเสมอ",
    //question 5
    "5. ด้านสิ่งประสงค์ล่อใจ *",
    "",
    "1. สิ่งที่ข้าพเจ้าอยากทำต้องมีความน่าสนใจ",
    "2. สิ่งที่ข้าพเจ้าจะทำต้องเป็นสิ่งที่มีอิทธิพลต่อครอบครัว",
    "3. สิ่งที่ข้าพเจ้าจะทำต้องเป็นสิ่งที่มีอิทธิพลด้านอารมณ์/ความรู้สึกกับคนหมู่มาก",
    "4. สิ่งที่ข้าพเจ้าจะทำต้องเป็นสิ่งที่มีอิทธิพลกับคนหมู่มาก",
    "5. สิ่งที่ข้าพเจ้าจะทำสิ่งนั้นสามารถทำให้มีอนาคตที่มั่นคง",
    "6. สิ่งที่ข้าพเจ้าจะทำสิ่งนั้นมีระดับผลตอบแทนในรูปแบบของเงินที่น่าสนใจ",
    "7. สิ่งที่ข้าพเจ้าจะทำสิ่งนั้นทำให้ข้าพเจ้าเป็นคนมีชื่อเสียง",
    "8. สิ่งที่ข้าพเจ้าจะทำเป็นสิ่งที่ทำให้ข้าพเจ้าได้รับความชื่นชม/ความสนใจ",
    "9. สิ่งนั้นทำให้ข้าพเจ้าใช้ความสามารถตนเองอย่างเต็มที่ เป็นอิสระ ไม่ขึ้นตรงกับใคร",
    "10. สิ่งที่นั้นต้องเป็นสิ่งที่คนทั่วไปอยากเอาเป็นแบบอย่าง",
    //question 6
    "6. ด้านผู้ปกครอง *",
    "",
    "1. พ่อแม่เป็นต้นแบบของการมีเป้าหมายที่ชัดเจน ในทุกเรื่องที่ท่านทำ",
    "2. พ่อแม่คอยบอกใหฉันคิดถึงเป้าหมายในการเรียนอยู่เสมอ",
    "3. พ่อแม่คอยติดตามดูแลพัฒนาการด้านการเรียนของฉันเสมอ",
    "4. พ่อแม่สงเสริมใหฉันค้นพบเป้าหมายในการประกอบอาชีพ",
    "5. พ่อแม่ส่งเสริมให้ฉันค้นพบ จุดดี จุดเปลี่ยน ของตัวฉันอยู่เสมอ",
    "6. พ่อแม่ช่วยหาข้อมูลเกี่ยวกับอาชีพในอนาคต",
    "7. โดยสวนใหญ่พ่อแม่สนับสนุนให้ฉันเรียนรู้และพัฒนาเป้าหมายของตัวเอง",
    "8. พ่อแม่มีการสร้างวินัยและฝึกระเบียบให้กับฉันอยู่เสมอ",
    "9. พ่อแม่เป็นคนที่สุภาพ รู้จักแบ่งปัน มีน้ำใจต่อผู้อื่น มีความกตัญญู ซื่อสัตย์สุจริต",
    "10. พ่อแม่รับฟัง เคารพความคิดเห็นซึ่งกันและกัน",
    //question 7
    "7. ด้านความเป็นตัวตน *",
    "",
    "1. ข้าพเจ้าชอบเคลื่อนไหวและทำกิจกรรมมาก",
    "2. ข้าพเจ้าชอบอยู่ร่วมกับผู้อื่น",
    "3. ข้าพเจ้าชอบทำบางอย่างมากกว่าอยู่นิ่งเฉย",
    "4. ข้าพเจ้าสามารถทำให้ผู้อื่นเชื่อมั่นในความคิดของข้าพเจ้า",
    "5. เมื่อข้าพเจ้าพูด ผู้อื่นจะรับฟังและทำตามที่ข้าพเจ้าพูด",
    "6. ข้าพเจ้าประพฤติปฏิบัติอย่างถูกตองและซื่อสัตยกับผู้อื่น",
    "7. ถ้าผู้อื่นไม่ให้ความยุติธรรมแก่ข้าพเจ้า ข้าพเจ้าจะให้อภัยแก่เขา",
    "8. ถ้าเพื่อนร่วมชั้นมีความลำบาก ข้าพเจ้าจะชอบช่วยเหลือพวกเขาเสมอ",
    "9. ข้าพเจ้าเคารพในกฎระเบียบและคำสั่ง",
    "10. เมื่อข้าพเจ้าเริ่มทำบางสิ่งบางอย่าง ข้าพเจ้าต้องทำใหมันสำเร็จเรียบร้อยทุกประการ",
    ""
  ];

  List<int> _groupValue = List<int>.generate(69, (index) => 0);

  List<Radio> _radioList = [
    Radio(),
    Radio(),
    Radio(),
    Radio(),
    Radio(),
    Radio()
  ];

  Radio _createRadio(int question, int value, int groupValueIndex) {
    Function f = (value) {
      _groupValue[groupValueIndex] = value;
      setState(() {});
    };
    return Radio(
      value: value,
      groupValue: _groupValue[groupValueIndex],
      onChanged: f,
    );
  }

  void _createRadioGroup(int question, int groupValueIndex) {
    for (int i = 1; i < 7; i++) {
      _radioList[i - 1] = _createRadio(question, i, groupValueIndex);
    }
  }

  void _computation() {
    print("start compute");
    print("**** ${_groupValue} ****");
    int aspiration = 0;
    int inspiration = 0;
    int motivation = 0;
    int motive = 0;
    int incentive = 0;
    int home1 = 0;
    int identity = 0;
    for (int i = 0; i < _groupValue.length; i++) {
      if (i >= 0 && i <= 9) {
        //0,1,2,3,4,5,6,7,8,9
        aspiration = aspiration + _groupValue[i];
      } else if (i >= 10 && i <= 19) {
        //10,11,12,13,14,15,16,17,18,19
        inspiration = inspiration + _groupValue[i];
      } else if (i >= 20 && i <= 29) {
        //20,21,22,23,24,25,26,27,28,29
        motivation = motivation + _groupValue[i];
      } else if (i >= 30 && i <= 38) {
        //30,31,32,33,34,35,36,37,38
        motive = motive + _groupValue[i];
      } else if (i >= 39 && i <= 48) {
        //39,40,41,42,43,44,45,46,47,48
        incentive = incentive + _groupValue[i];
      } else if (i >= 49 && i <= 58) {
        //49,50,51,52,53,54,55,56,57,58
        home1 = home1 + _groupValue[i];
      } else if (i >= 59 && i <= 68) {
        //59,60,61,62,63,64,65,66,67,68
        identity = identity + _groupValue[i];
      }
    }
    double idol = (4.113 * (aspiration / 10.0)) +
        (4.161 * (inspiration / 10.0)) +
        (3.1 * (motivation / 10.0)) +
        (3.483 * (motive / 9.0)) +
        (3.254 * (incentive / 10.0)) +
        (2.298 * (home1 / 10.0)) +
        (5.972 * (identity / 10.0));
    double idol1 = 1.0 / (1.0 + exp(-(104.623 - idol)));
    double idol2 = 1.0 / (1.0 + exp(-(131.086 - idol)));
    double idol3 = 1 - idol1 - idol2;
    String output = "";
    if (idol1 > idol2 && idol1 > idol3) {
      output = "ระดับต่่า";
    } else if (idol2 > idol1 && idol2 > idol3) {
      output = "ระดับปานกลาง";
    } else {
      output = "ระดับสูง";
    }
    showDialog(
        context: context,
        builder: (BuildContext context) => AlertDialog(
              content: Text("ระดับไอดอลคือ : ${output}"),
              actions: [
                FlatButton(
                  child: Text('ปิด'),
                  onPressed: () => Navigator.of(context).pop(),
                )
              ],
            ));
  }

  Widget _getItem(BuildContext context, int index) {
    if (index == 0 ||
        index == 12 ||
        index == 24 ||
        index == 36 ||
        index == 47 ||
        index == 59 ||
        index == 71) {
      return Padding(
        padding: EdgeInsets.only(top: 20),
        child: Text("${_q[index]}"),
      );
    } else if (index == 1 ||
        index == 13 ||
        index == 25 ||
        index == 37 ||
        index == 48 ||
        index == 60 ||
        index == 72) {
      return Row(
        children: [
          SizedBox(
            width: 100,
          ),
          SizedBox(
            width: 60,
            child: Text("จริงที่สุด"),
          ),
          SizedBox(
            width: 30,
            child: Text("จริง"),
          ),
          SizedBox(
            width: 60,
            child: Text("ค่อนข้างจริง"),
          ),
          SizedBox(
            width: 60,
            child: Text("ค่อนข้างไม่จริง"),
          ),
          SizedBox(
            width: 40,
            child: Text("ไม่จริง"),
          ),
          SizedBox(
            width: 50,
            child: Text("ไม่จริงเลย"),
          )
        ],
      );
    } else if (index == 83) {
      return Center(
        child: RaisedButton(
          child: Text(
            'ประมาณ',
            style: TextStyle(color: Colors.white),
          ),
          onPressed: _computation,
        ),
      );
    } else {
      if (index >= 2 && index <= 11) {
        _createRadioGroup(index - 2, index - 2); //0,1,2,3,4,5,6,7,8,9
      } else if (index >= 14 && index <= 23) {
        _createRadioGroup(index - 4, index - 4); //10,11,12,13,14,15,16,17,18,19
      } else if (index >= 26 && index <= 35) {
        _createRadioGroup(index - 6, index - 6); //20,21,22,23,24,25,26,27,28,29
      } else if (index >= 38 && index <= 46) {
        //9
        _createRadioGroup(index - 8, index - 8); //30,31,32,33,34,35,36,37,38
      } else if (index >= 49 && index <= 58) {
        _createRadioGroup(
            index - 10, index - 10); //39,40,41,42,43,44,45,46,47,48
      } else if (index >= 61 && index <= 70) {
        _createRadioGroup(
            index - 12, index - 12); //49,50,51,52,53,54,55,56,57,58
      } else if (index >= 73 && index <= 82) {
        _createRadioGroup(
            index - 14, index - 14); //59,60,61,62,63,64,65,66,67,68
      }

      return Row(
        children: [
          SizedBox(
            width: 100,
            child: Text("${_q[index]}"),
          ),
          _radioList[5],
          _radioList[4],
          _radioList[3],
          _radioList[2],
          _radioList[1],
          _radioList[0]
        ],
      );
    }
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: ListView.builder(
        itemBuilder: _getItem,
        itemCount: _q.length,
      ),
    );
  }
}
